snappyHexPMU_baffle_dwtInner/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2306                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1;

xmin  -0.02;
xmax  0.58  ;
ymin  -0.02;
ymax  0.18  ;
zmin  -0.02;
zmax   0.28 ;


// larger than stl
vertices
(
//    x  y z
    ( $xmin   $ymin    $zmin)
    ( $xmax   $ymin    $zmin)
    ( $xmin   $ymax    $zmin)
    ( $xmin   $ymin    $zmax)
    ( $xmax   $ymax    $zmin)
    ( $xmax   $ymin    $zmax)
    ( $xmin   $ymax     $zmax)
    ( $xmax   $ymax     $zmax)
);

// sizing: target cell_size = 0.005m
// n_cells = dimension_length / cell_size
// n_x = 0.6 / 0.005 = 120   - actual dim (.55, 0.16, .26)
// n_y = 0.2 / 0.005 = 40
// n_z = 0.3 / 0.005 = 60 

blocks
(
    // hex (0 1 2 3 4 5 6 7) (180 284 80) simpleGrading (1 1 1) // production background mesh expanded with offset
    hex (0 1 4 2 3 5 7 6) (120 40 60) simpleGrading (1 1 1) // coarser development mesh expanded with offset
);

edges
(
);

boundary
(
    blockMeshOuter
    {
//        type empty;
        type patch;
        faces
        (
        (0 1 4 2)    // bottom
        (3 6 7 5)    // top
        (0 3 5 1)    // front
        (2 4 7 6)    // back
        (0 2 6 3)    // left
        (1 5 7 4)    // right
        );

    }
);


// ************************************************************************* //
