snappyHexPMU_baffle_dwtInner/constant/fluid/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

//

transportModel  Newtonian;


// dynamic viscosity mu = rho*nu = 2.108E-03 kg/(m s)

nu              nu [0 2 -1 0 0 0 0]  2.1426E-07;

rho             rho [1 -3 0 0 0 0 0]  9838.01 ; // density of the fluid

beta            beta [0 0 0 -1 0 0 0]  1.21E-04 ; // Volumetric expansion coeff

TRef            TRef [0 0 0 1 0 0 0]  573.0 ; // ref temp

Pr              Pr [0 0 0 0 0 0 0]    0.02 ; // Prandtl

Prt            Prt [0 0 0 0 0 0 0]    1.0 ; // Turbulent Prandtl

// ************************************************************************* //
