snappyHexPMU_baffle_dwtInner/constant/g
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2206                                  |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
      version 2.0;
      format ascii;
      class uniformDimensionedVectorField;
      location "constant";
      object g;
}


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * // 
    dimensions [0 1 -2 0 0 0 0];

    value      (0 0 -9.8); // 9.81
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
