snappyHexPMU_baffle_dwtInner/0/fluid/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

uinlet         0.0034941 ;  //  0.165/(9838.01*4800e-6)
internalField   uniform ($uinlet 0 0);

boundaryField
{
    fs_interface
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
    dwt_f_interface
    {
         type            fixedValue;
         value           uniform (0 0 0);
    }

    inlet
    {
        type            fixedValue;
        value           uniform ($uinlet 0 0) ;
    }
    outlet
    {
        type            zeroGradient;
    }

    fluid_to_solid
    {
        type            fixedValue;
        value           uniform (0 0 0);
    }
}


// ************************************************************************* //
