snappyHexPMU_baffle_dwtInner/0/fluid/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 1 -3 -1 0 0 0 ];

K           20.4 ;

internalField   uniform $K ;

boundaryField
{
    

    fs_interface
    {
        type            zeroGradient;
    }
    dwt_f_interface
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            fixedValue;
        value           uniform $K ;
    }

    
}


// ************************************************************************* //
