snappyHexPMU_baffle_dwtInner/0/fluid/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/fluid";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

alphat          1.092513e-05 ; // alphaf = 20.4/(9838.01*189.8) // 1.092513

internalField   uniform $alphat;

boundaryField
{
    fs_interface
    {
        type            zeroGradient;
    }
    dwt_f_interface
    {
        type            zeroGradient;
    }

    inlet
    {
        type            zeroGradient;
    }
    outlet
    {
        type            zeroGradient;
    }
    fluid_to_solid
    {
        type            zeroGradient;
    }

    
}


// ************************************************************************* //
