snappyHexPMU_baffle_dwtInner/0/solid/K
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      K;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 1 1 -3 -1 0 0 0 ];

K           27.244 ;

internalField   uniform $K ;

boundaryField
{
    fs_interface
    {
        type            zeroGradient;
    }
    first_wall
    {
        type            zeroGradient;
    }
    dwt_s_interface
    {
        type            zeroGradient;
    }
    dwt_inner
    {
        type            zeroGradient;
    }
    dwt_exterior
    {
        type            zeroGradient;
    }


    exterior
    {
        type            zeroGradient;
    }

    solid_to_fluid
    {
        type            fixedValue;
        value           uniform $K ;
    }


}


// ************************************************************************* //
