snappyHexPMU_baffle_dwtInner/0/solid/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


dimensions       [0 0 0 1 0 0 0];

internalField   uniform 568.0 ;

boundaryField
{
    fs_interface
    {
        type            zeroGradient;
    }
    first_wall
    {
        type            fixedGradient;   //    -q/k_w = (0.32e+06 / 27.244 ) // check if it is +ve 
        gradient        uniform 1.174571e+04 ; 
    }
    dwt_s_interface
    {
        type            fixedGradient;   //    -q/k_w = (-0.323e+06 / 27.244 ) // check if it is +ve  
        gradient        uniform -1.1855821e+04 ;
    }
    dwt_inner
    {
        type            fixedGradient;   //    -q/k_w = (-0.323e+06 / 27.244 ) // check if it is +ve  
        gradient        uniform -1.1855821e+04 ;
    }
    dwt_exterior
    {
        type            fixedGradient;   //    -q/k_w = (-0.323e+06 / 27.244 ) // check if it is +ve  
        gradient        uniform -1.1855821e+04 ;
    }


    exterior
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {

//        type            zeroGradient;
       type                solidWallMixedTemperatureCoupled; // solidWallMixedTemperatureCoupled
       Tnbr                       T;                                //
       K                          K;
       value                uniform 573.0 ;
    }
   

}



// ************************************************************************* //
