snappyHexPMU_baffle_dwtInner/0/solid/sigma
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1912                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0/solid";
    object      sigma;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ -1 -3 3 0 0 2 0 ];

internalField     uniform 1.1868e+06;

boundaryField
{

    fs_interface
    {
        type            zeroGradient;
    }
    first_wall
    {
        type            zeroGradient;
    }
    dwt_s_interface
    {
        type            zeroGradient;
    }
    dwt_inner
    {
        type            zeroGradient;
    }
    dwt_exterior
    {
        type            zeroGradient;
    }


    exterior
    {
        type            zeroGradient;
    }
    solid_to_fluid
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //

