snappyHexPMU_baffle_dwtInner/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default backward;
}

gradSchemes
{
    default        leastSquares;
    grad(T)        bounded Gauss linear;
}

divSchemes
{
    default         Gauss linear;
    div(phi,U)      Gauss linear ; // Gauss linear; // switch to LUST or linearUpwind
    div(phi,T)      bounded Gauss linear;
    div((nuEff*dev(T(grad(U))))) bounded Gauss linear;
}

laplacianSchemes
{
    default                 Gauss linear corrected;
    laplacian(alphaEff,T)   bounded Gauss linear ;
}

interpolationSchemes
{
    default                linear;
}

snGradSchemes
{
    default         corrected;
}


// ************************************************************************* //
